---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.FasciaType
source: html/33657fed-2e50-92c2-6710-871f977dd5e0.htm
---
# FasciaType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.